## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
terraform-secrets.tf
```
```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `github_actions_secret.aws_kms_key_id[0]`       |
|        | `github_actions_secret.rds_snapshot_identifier` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.aws_kms_key_id[0] will be created
  + resource "github_actions_secret" "aws_kms_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "STAGING_AWS_KMS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.rds_snapshot_identifier will be created
  + resource "github_actions_secret" "rds_snapshot_identifier" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "STAGING_SHARED_RDS_SNAPSHOT_IDENTIFIER"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
